# 结合iput、字典、if判断，做一个查询流行语含义的电子词典程序
slang_dict = {"数智化":"数字化与智能化的融合，强调在数字化基础上引入智能技术以提升生产效率和管理水平。",
              "智能向善":"指人工智能的发展应有利于人类福祉，推动产业变革和可持续发展。"}
slang_dict["未来产业"] = "由前沿技术驱动的新兴产业，包括未来制造、未来信息等领域。"
slang_dict["city不city"] = "源自外国博主在中国旅游时的对话，反映了外国人对中国城市的赞美。"
slang_dict["硬控"] = "指在某些情况下采取严格控制的措施，常用于社会治理和管理领域。"

query = input("请输入您想要查询的流行语：")
if query in slang_dict:
    print("您查询的这个词" + query + "含义如下")
    print(slang_dict[query])
else:
    print("您查询的流行语暂未收录。")
    print("当前本词典收录词条数为：" + str(len(slang_dict)) + "条。")